#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/AWS-Image-Labels-Generator/runs/run-WnwnaS1zPmDWmuzx

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
random_id.bucket_id: Refreshing state... [id=BBqopg]
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=d92272d51c32803197e779824b2884d09ca94886]
aws_iam_policy.rekognition_policy: Refreshing state... [id=arn:aws:iam::871308866502:policy/rekognition-image-labels-rekognition-policy]
aws_iam_group.developer_group: Refreshing state... [id=rekognition-image-labels-developer-group]
aws_iam_user.project_user: Refreshing state... [id=rekognition-image-labels-developer-user]
aws_secretsmanager_secret.dev_keys: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-1:871308866502:secret:rekognition-image-labels-dev-credentials-new-KWvEDW]
aws_iam_role.lambda_role: Refreshing state... [id=rekognition-image-labels-rekognition-lambda-role]
aws_s3_bucket.images_bucket: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_iam_group_membership.developer_team: Refreshing state... [id=rekognition-image-labels-group-membership]
aws_iam_access_key.project_user_key: Refreshing state... [id=AKIA4VXQOGPDJTJUZ7WX]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=rekognition-image-labels-rekognition-lambda-role-20260118145920640300000002]
aws_secretsmanager_secret_version.dev_keys_val: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-1:871308866502:secret:rekognition-image-labels-dev-credentials-new-KWvEDW|terraform-20260118161327478900000004]
aws_s3_bucket_public_access_block.images_bucket_access: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_s3_bucket_versioning.versioning_images_bucket: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_iam_policy.rekognition_s3_policy: Refreshing state... [id=arn:aws:iam::871308866502:policy/rekognition-image-labels-s3-policy]
aws_s3_bucket_server_side_encryption_configuration.sse: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_lambda_function.rekognition_lambda: Refreshing state... [id=rekognition-image-labels-rekognition-lambda]
aws_s3_bucket_lifecycle_configuration.images_bucket_lifecycle: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_iam_group_policy_attachment.group_attach["arn:aws:iam::871308866502:policy/rekognition-image-labels-rekognition-policy"]: Refreshing state... [id=rekognition-image-labels-developer-group-20260118161326256600000003]
aws_iam_group_policy_attachment.group_attach["arn:aws:iam::871308866502:policy/rekognition-image-labels-s3-policy"]: Refreshing state... [id=rekognition-image-labels-developer-group-20260118161326255600000002]
aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/rekognition-image-labels-rekognition-lambda]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.rekognition_lambda will be updated in-place
  ~ resource "aws_lambda_function" "rekognition_lambda" {
        id                             = "rekognition-image-labels-rekognition-lambda"
      ~ last_modified                  = "2026-01-18T16:13:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "jF/nVIK5zgcK99q3xXnEphnwlZGQXpKSkxV4ajJdKpY=" -> "Zj8HBWshpia/pb66OMqCq/yfFHiNtHtzJvciJvi0Cwo="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # local_file.python_config will be created
  + resource "local_file" "python_config" {
      + content              = jsonencode(
            {
              + bucket_name = "rekognition-image-labels-images-bucket-041aa8a6"
              + region      = "ap-southeast-1"
              + secret_id   = "rekognition-image-labels-dev-credentials-new"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./config.json"
      + id                   = (known after apply)
    }

  # terraform_data.setup_script will be created
  + resource "terraform_data" "setup_script" {
      + id = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 7 estimated
           $0.0/mo +$0.0

```

</details>